0/B0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      B0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -2 0 0 -1 0 ];


internalField  uniform (0 0 100.0);

boundaryField
{
    periodic_0
    {
        type            cyclic;
    }
    periodic_1
    {
        type            cyclic;
    }

    wall_2
    {
        type            zeroGradient;
    }

    wall_3
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
