0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1.0 0 0); 


boundaryField
{
// inlet
    periodic_0
    {
        type            cyclic;
    }

//outlet
    periodic_1
    {
        type            cyclic;
    }



// Side walls
    wall_2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

// Hartmann walls
    wall_3
    {
        type            fixedValue;
        value           uniform (0 0 0);           
    }

}


// ************************************************************************* //
