0/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ -1 -3 3 0 0 2 0 ];

sigma 0.002 ;

internalField   uniform $sigma;

boundaryField
{

    periodic_0
    {
        type            cyclic;
    }
    periodic_1
    {
        type            cyclic;
    }

  
    wall_2
    {
        type            fixedValue;
        value           uniform $sigma;
    }
    wall_3
    {
        type            fixedValue;
        value           uniform $sigma;
    }
     
}


// ************************************************************************* //
