constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//

transportModel  Newtonian;


// dynamic viscosity mu = rho*nu = 0.002 kg/(m s)

nu              nu [0 2 -1 0 0 0 0]    0.002 ; // gallium at T=20 C

rho             rho [1 -3 0 0 0 0 0]    1.0; // density of the fluid - used for Lorentz force computation

// ************************************************************************* //
