system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     epotFoam_isoTh; // cEpotFoam; 

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         800;

deltaT          0.6e-2;

writeControl    clockTime;

writeInterval   7200;

//writeControl    timeStep;

//writeInterval   2;


purgeWrite      3;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

// Maximum diffusion number
maxDi           10.0;

maxCo           0.05;

maxDeltaT       5.0e-2 ; 

timeStart       7.5;

timeStart2       40;

functions
{

//#include "functions/FOfieldAverage"
//#include "FOprimeValues"
//#include "functions/FOwallShear"
//#include "probes"
//#include "surfacesPlaneRaw"
//#include "functions/surfacePost"
//#include "functions/codedFunctions"
//#includeFunc "sampleSets"
}

//OptimisationSwitches
//{
//    fileHandler collated; // collated: thread buffer size for queued file writes.
    //  If set to 0 or not sufficient for the file size, threading is not used.
    //  Default: 1e9
//    maxThreadFileBufferSize 1e11; // v1712 default is 0;
//}


// ************************************************************************* //
